Kyle Timmermans (Lab4) - Prof. Ying Mao - Rose Hill - 12/2/20

In [3]:
%load_ext sql
%sql sqlite:///Lab4.db3

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @Lab4.db3'

Q1 - {A} is a superkey for a relation T(A,B,C,D).

In [4]:
%%sql sqlite://
    DROP TABLE IF EXISTS TP;
    CREATE TABLE TP (A CHAR(20), B INTEGER, C INTEGER, D INTEGER);
    DROP TABLE IF EXISTS TF;
    CREATE TABLE TF (A CHAR(20), B INTEGER, C INTEGER, D INTEGER);

Done.
Done.
Done.
Done.

[]

2 Tables that satisfy and doesn't satisfy for Q1

In [6]:
%%sql sqlite://
    INSERT INTO TP VALUES ('Jason',1997, 5, 19);
    INSERT INTO TP VALUES ('Yolanda',1997, 1, 10);
    INSERT INTO TP VALUES ('Kris',1997, 7, 14);
    INSERT INTO TP VALUES ('Maggie',1997, 11, 26);
    INSERT INTO TP VALUES ('Heng',1998, 3, 5);
    -------
    INSERT INTO TF VALUES ('Jason',1997, 5, 19);
    INSERT INTO TF VALUES ('Jason',1997, 1, 10);
    INSERT INTO TF VALUES ('Kris',1997, 7, 14);
    INSERT INTO TF VALUES ('Maggie',1997, 11, 26);
    INSERT INTO TF VALUES ('Heng',1998, 3, 5);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

TP Table satisfies requirement

In [8]:
%%sql sqlite://
    SELECT COUNT(*)
    FROM TP AS TP1, TP AS TP2
    WHERE TP1.A = TP2.A AND (TP1.B != TP2.B OR TP1.C != TP2.C OR TP1.D != TP2.D)

Done.

[(0,)]

TF Table doesn't satisfy requirment

In [9]:
%%sql sqlite://
    SELECT COUNT(*)
    FROM TF AS TF1, TF AS TF2
    WHERE TF1.A = TF2.A AND (TF1.B != TF2.B OR TF1.C != TF2.C OR TF1.D != TF2.D)

Done.

[(2,)]

Q2 - The combination of two attributes in the relation T(A,B,C,D) are each keys

- Needs 4 tables

In [38]:
%%sql sqlite://
    DROP TABLE IF EXISTS Q2T;
    CREATE TABLE Q2T (A INTEGER, B INTEGER, C INTEGER, D INTEGER);

Done.
Done.

[]

In [39]:
%%sql sqlite://
    INSERT INTO Q2T VALUES (1, 0, 1, 1);
    INSERT INTO Q2T VALUES (1, 1, 0, 0);
    INSERT INTO Q2T VALUES (0, 0, 0, 0);
    INSERT INTO Q2T VALUES (1, 1, 1, 1);
    INSERT INTO Q2T VALUES (0, 1, 1, 0);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [50]:
%sql SELECT * FROM Q2T GROUP BY A,B;

 * sqlite:///Lab4.db3
Done.

[(0, 0, 0, 0), (0, 1, 1, 0), (1, 0, 1, 1), (1, 1, 0, 0)]

Keys for Q2:
Q2T(AB)
Q2T(AC)
Q2T(AD)
Q2T(BC)
Q2T(BD)
Q2T(CD)

Q3 - TGD between two relations A and B

- Needs 4 Tables

In [90]:
%%sql sqlite://
    DROP TABLE IF EXISTS sailors;
    CREATE TABLE sailors (sid INTEGER, sname CHAR(20), rating INTEGER, age INTEGER);
    DROP TABLE IF EXISTS reserves;
    CREATE TABLE reserves(sid INTEGER, bid INTEGER, sname CHAR(20), bname CHAR(20), date CHAR(20));

Done.
Done.
Done.
Done.

[]

Tables for Q3

In [91]:
%%sql sqlite://
    INSERT INTO sailors VALUES (1, 'Johhny', 9, 25);
    INSERT INTO sailors VALUES (2, 'David', 7, 40);
    INSERT INTO sailors VALUES (3, 'Sam', 4, 50);
    INSERT INTO sailors VALUES (4, 'Connor', 2, 55);
    -------  
    INSERT INTO reserves VALUES (1, 1, 'Johnny', 'Crimson', '5-10-2020');
    INSERT INTO reserves VALUES (2, 2, 'David', 'Ripetide', '7-25-2020');
    INSERT INTO reserves VALUES (3, 1, 'Sam', 'Crimson', '12-2-2020');
    INSERT INTO reserves VALUES (4, 2, 'Connor', 'Ripetide', '12-2-2020');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [93]:
%%sql sqlite://
    SELECT bid
    FROM reserves R, sailors S
    WHERE S.sid=R.sid And S.sname='Sam'

Done.

[(1,)]

This is a tuple generating dependancy here between the sailors and reserves table because if 'Sam' isn't a value in reserves, then bid is returned as an empty set.

Q4 - A multivalued dependency (MVD)

In [111]:
%%sql sqlite://
    DROP TABLE IF EXISTS R;
    CREATE TABLE R (A INTEGER, B INTEGER, C INTEGER, D INTEGER, E INTEGER);
    DROP TABLE IF EXISTS X;
    CREATE TABLE X (A INTEGER, B INTEGER, C INTEGER);
    DROP TABLE IF EXISTS Y;
    CREATE TABLE Y (C INTEGER, D INTEGER, E INTEGER);

Done.
Done.
Done.
Done.
Done.
Done.

[]

In [112]:
%%sql sqlite://
    INSERT INTO R VALUES (1, 2, 3, 4, 5);
    INSERT INTO X VALUES (1, 2, 3);
    INSERT INTO Y VALUES (1, 2, 3);

1 rows affected.
1 rows affected.
1 rows affected.

[]

Must have self joins, nested SQL calls, and EXISTS/NOT EXISTS

In [114]:
%%sql sqlite://
SELECT *
FROM R as n1, X as n2
WHERE n1.A = n2.B and
      NOT EXISTS (
          SELECT *
          FROM Y n3
          WHERE n3.C = n1.A and
                n3.D = n1.B and
                n3.E = n1.C);

Done.

[]

Two tuples satisfy the conditions stated in Q4